app/Controllers/Admin/Bairros.php

SELECT *
FROM `bairros`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `bairros`
---
    public function index()
    {
        $data = [
            'titulo' => 'Listando os bairros atendidos',
            'titulo_page'     => 'Bairros',
            'bairros' => $this->bairroModel->withDeleted(true)->paginate(10),

SELECT *
FROM `bairros`
WHERE `id` = '1'
GROUP BY `bairros`.`id`
ORDER BY `bairros`.`id` ASC
 LIMIT 1
---
    private function buscaBairroOu404($id = null)
    {
        if (!$id || !$bairro = $this->bairroModel->withDeleted(true)->where('id', $id)->first()) {