app/Controllers/Admin/Entregadores.php

    public function index()
    {
        $data = [
            'titulo' => 'Listando os entregadores',
            'titulo_page'     => 'Entregadores',
            'entregadores' => $this->entregadorModel->withDeleted(true)->paginate(10),
---
SELECT *
FROM `entregadores`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `entregadores`