app/Controllers/Admin/Home.php

    public function index()
    {
        $data = [
            'titulo' => 'Home da área restrita',
            'titulo_page' => 'Dashboard',
            'valorPedidosEntregues' => $this->pedidoModel->valorPedidosEntregues(),
            'valorPedidosCancelados' => $this->pedidoModel->valorPedidosCancelados(),
            'totalClientesAtivos' => $this->usuarioModel->recuperaTotalClientesAtivos(),
            'totalEntregadoresAtivos' => $this->entregadorModel->recuperaTotalEntregadoresAtivos(),
            'produtosMaisVendidos' => $this->pedidoProdutoModel->recuperaProdutosMaisVendidos(5),
            'clientesMaisAssiduos' => $this->pedidoModel->recuperaClientesMaisAssiduos(5),
            'entregadoresMaisAssiduos' => $this->entregadorModel->recuperaEntregadoresMaisAssiduos(5),
        ];

        $novosPedidos = $this->pedidoModel->where('situacao', 0)->orderBy('criado_em', 'DESC')->findAll();
---
SELECT *
FROM `pedidos`
WHERE `situacao` = 0
AND `pedidos`.`deletado_em` IS NULL
ORDER BY `criado_em` DESC