app/Controllers/Admin/Medidas.php

SELECT *
FROM `medidas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `medidas`
---
    public function index()
    {
        $data = [
            'titulo' => 'Listando as medidas dos produtos',
            'titulo_page'     => 'Medidas',
            'medidas' => $this->medidaModel->withDeleted(true)->paginate(10),