app/Controllers/Admin/Produtos.php

    public function index()
    {
        $data = [
            'titulo' => 'Listando os produtos',
            'titulo_page' => 'Produtos',
            'produtos' => $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
                                            ->join('categorias', 'categorias.id = produtos.categoria_id')
                                            ->withDeleted(true)->paginate(10),
---
SELECT COUNT(*) AS `numrows`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
SELECT `produtos`.*, `categorias`.`nome` AS `categoria`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
 LIMIT 10

    private function buscaProdutoOu404($id = null)
    {
        if (!$id || !$produto = $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
                                    ->join('categorias', 'categorias.id = produtos.categoria_id')
                                    ->where('produtos.id', $id)
                                    ->withDeleted(true)->first()) {
---
SELECT `produtos`.*, `categorias`.`nome` AS `categoria`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
WHERE `produtos`.`id` = '3'
GROUP BY `produtos`.`id`
ORDER BY `produtos`.`id` ASC
 LIMIT 1