app/Models/PedidoModel.php

SELECT `usuarios`.`nome`, COUNT(*) AS pedidos
FROM `pedidos`
JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
WHERE `situacao` = 2
AND `pedidos`.`deletado_em` IS NULL
GROUP BY `usuarios`.`nome`
ORDER BY `pedidos` DESC
 LIMIT 5
---
    public function recuperaClientesMaisAssiduos(int $quantidade) {

        return $this->select('usuarios.nome, COUNT(*) AS pedidos')
                    ->join('usuarios', 'usuarios.id = pedidos.usuario_id')
                    ->where('situacao', 2) // Entregue
                    ->limit($quantidade)
                    ->groupBy('usuarios.nome')
                    ->orderBy('pedidos', 'DESC')
                    ->find();