app/Models/ProdutoEspecificacaoModel.php

SELECT COUNT(*) AS `numrows`
FROM `produtos_especificacoes`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_especificacoes`.`medida_id`
WHERE `produtos_especificacoes`.`produto_id` = 3
SELECT `medidas`.`nome` AS `medida`, `produtos_especificacoes`.*
FROM `produtos_especificacoes`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_especificacoes`.`medida_id`
WHERE `produtos_especificacoes`.`produto_id` = 3
 LIMIT 10
---
    public function buscaEspecificacoesDoProduto(int $produto_id = null, $quantidade_paginacao) {

        return $this->select('medidas.nome AS medida, produtos_especificacoes.*')
                    ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id')
                    ->join('produtos', 'produtos.id = produtos_especificacoes.medida_id')
                    ->where('produtos_especificacoes.produto_id', $produto_id)
                    ->paginate($quantidade_paginacao);